; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_3 type_1)
 (:predicates (pred_4 ?v4 - type_3 ?v7 - type_2)
 	      (pred_2 ?v6 - object ?v7 - type_2)
	      (pred_1 ?v4 - type_3 ?v3 - type_1)
	      (pred_3 ?v4 - type_3 ?v6 - object ?v3 - type_1))

   (:action op_3
       :parameters  (?v4 - type_3 ?v8 ?v2 - type_2)
       :precondition (and  (pred_4 ?v4 ?v8))
       :effect (and  (pred_4 ?v4 ?v2)
		     (not (pred_4 ?v4 ?v8))))

   (:action op_2
       :parameters (?v4 - type_3 ?v5 - object ?v1 - type_2 ?v3 - type_1)
       :precondition  (and  (pred_2 ?v5 ?v1) (pred_4 ?v4 ?v1) (pred_1 ?v4 ?v3))
       :effect (and (pred_3 ?v4 ?v5 ?v3)
		    (not (pred_2 ?v5 ?v1)) 
		    (not (pred_1 ?v4 ?v3))))

   (:action op_1
       :parameters (?v4 - type_3 ?v5 - object ?v1 - type_2 ?v3 - type_1)
       :precondition  (and  (pred_3 ?v4 ?v5 ?v3) (pred_4 ?v4 ?v1))
       :effect (and (pred_2 ?v5 ?v1)
		    (pred_1 ?v4 ?v3)
		    (not (pred_3 ?v4 ?v5 ?v3)))))

; problem
(define (problem gripper-1-3-3)
(:domain gripper-strips)
(:objects obj_06 - type_3
obj_05 obj_04 - type_1
obj_03 obj_02 obj_09 - type_2
obj_07 obj_08 obj_01 - object)
(:init
(pred_4 obj_06 obj_09)
(pred_1 obj_06 obj_05)
(pred_1 obj_06 obj_04)
(pred_2 obj_07 obj_09)
(pred_2 obj_08 obj_09)
(pred_2 obj_01 obj_02)
)
(:goal
(and
(pred_2 obj_07 obj_09)
(pred_2 obj_08 obj_09)
(pred_2 obj_01 obj_09)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_3 obj_06 ?b obj_04))))
)
)

; plan
1. (op_3 obj_06 obj_09 obj_02)
   deleted: (pred_4 obj_06 obj_09)
   added: (pred_4 obj_06 obj_02)
   goals met: 2 of 3
2. (op_2 obj_06 obj_01 obj_02 obj_05)
   deleted: (pred_2 obj_01 obj_02) (pred_1 obj_06 obj_05)
   added: (pred_3 obj_06 obj_01 obj_05)
   goals met: 2 of 3
3. (op_3 obj_06 obj_02 obj_09)
   deleted: (pred_4 obj_06 obj_02)
   added: (pred_4 obj_06 obj_09)
   goals met: 2 of 3
4. (op_1 obj_06 obj_01 obj_09 obj_05)
   deleted: (pred_3 obj_06 obj_01 obj_05)
   added: (pred_2 obj_01 obj_09) (pred_1 obj_06 obj_05)
   goals met: 3 of 3
